RobCTs/IoT_Signal_analysis/components/components/soc/esp32c6/include/soc/slc_struct.h
/** Type of slc_cmd_infor0 register
 *  reserved
 */
typedef union {
    struct {
        /** cmd_content0 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t cmd_content0:32;
    };
    uint32_t val;
} sdio_slc_cmd_infor0_reg_t;

/** Type of slc_cmd_infor1 register
 *  reserved
 */
typedef union {
    struct {
        /** cmd_content1 : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t cmd_content1:32;
    };
    uint32_t val;
} sdio_slc_cmd_infor1_reg_t;

/** Type of slc0_length register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_len : RO; bitpos: [19:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_len:20;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sdio_slc0_length_reg_t;

/** Type of slc_sdio_crc_st0 register
 *  reserved
 */
typedef union {
    struct {
        /** dat0_crc_err_cnt : RO; bitpos: [7:0]; default: 0;
         *  reserved
         */
        uint32_t dat0_crc_err_cnt:8;
        /** dat1_crc_err_cnt : RO; bitpos: [15:8]; default: 0;
         *  reserved
         */
        uint32_t dat1_crc_err_cnt:8;
        /** dat2_crc_err_cnt : RO; bitpos: [23:16]; default: 0;
         *  reserved
         */
        uint32_t dat2_crc_err_cnt:8;
        /** dat3_crc_err_cnt : RO; bitpos: [31:24]; default: 0;
         *  reserved
         */
        uint32_t dat3_crc_err_cnt:8;
    };
    uint32_t val;
} sdio_slc_sdio_crc_st0_reg_t;

/** Type of slc0_eof_start_des register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_eof_start_des_addr : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t slc0_eof_start_des_addr:32;
    };
    uint32_t val;
} sdio_slc0_eof_start_des_reg_t;

/** Type of slc0_push_dscr_addr register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_rx_push_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  the current descriptor address when slc0 gets  a link descriptor, aligned with word
         */
        uint32_t slc0_rx_push_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc0_push_dscr_addr_reg_t;

/** Type of slc0_done_dscr_addr register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_rx_done_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  the current descriptor address when slc0 finishes reading data from one buffer,
         *  aligned with word
         */
        uint32_t slc0_rx_done_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc0_done_dscr_addr_reg_t;

/** Type of slc0_sub_start_des register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_sub_pac_start_dscr_addr : RO; bitpos: [31:0]; default: 0;
         *  the current descriptor address when slc0 gets  a link descriptor, aligned with word
         */
        uint32_t slc0_sub_pac_start_dscr_addr:32;
    };
    uint32_t val;
} sdio_slc0_sub_start_des_reg_t;

/** Type of slc0_dscr_cnt register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc0_rx_dscr_cnt_lat : RO; bitpos: [9:0]; default: 0;
         *  the number of descriptors got by slc0 when it tries to read data from memory
         */
        uint32_t slc0_rx_dscr_cnt_lat:10;
        uint32_t reserved_10:6;
        /** slc0_rx_get_eof_occ : RO; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc0_rx_get_eof_occ:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc0_dscr_cnt_reg_t;


/** Group: Debud registers */
/** Type of slc0txfifo_pop register
 *  reserved
 */
typedef union {
    struct {
        /** slc0_txfifo_rdata : RO; bitpos: [10:0]; default: 1024;
         *  reserved
         */
        uint32_t slc0_txfifo_rdata:11;
        uint32_t reserved_11:5;
        /** slc0_txfifo_pop : R/W/SC; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc0_txfifo_pop:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc0txfifo_pop_reg_t;

/** Type of slc1txfifo_pop register
 *  reserved
 */
typedef union {
    struct {
        /** slc1_txfifo_rdata : RO; bitpos: [10:0]; default: 1024;
         *  reserved
         */
        uint32_t slc1_txfifo_rdata:11;
        uint32_t reserved_11:5;
        /** slc1_txfifo_pop : R/W/SC; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t slc1_txfifo_pop:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} sdio_slc1txfifo_pop_reg_t;

/** Type of slc_ahb_test register
 *  reserved
 */
typedef union {
    struct {
        /** slc_ahb_testmode : R/W; bitpos: [2:0]; default: 0;
         *  reserved
         */
        uint32_t slc_ahb_testmode:3;
        uint32_t reserved_3:1;
        /** slc_ahb_testaddr : R/W; bitpos: [5:4]; default: 0;
         *  reserved
         */
        uint32_t slc_ahb_testaddr:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} sdio_slc_ahb_test_reg_t;


/** Group: Version registers */
/** Type of slcdate register
 *  ******* Description ***********
 */
typedef union {
    struct {
        /** slc_date : R/W; bitpos: [31:0]; default: 554182400;
         *  reserved
         */
        uint32_t slc_date:32;
    };
    uint32_t val;
} sdio_slcdate_reg_t;


typedef struct slc_dev_t {
    volatile sdio_slcconf0_reg_t slcconf0;
    volatile sdio_slc0int_raw_reg_t slc0int_raw;
    volatile sdio_slc0int_st_reg_t slc0int_st;
    volatile sdio_slc0int_ena_reg_t slc0int_ena;
    volatile sdio_slc0int_clr_reg_t slc0int_clr;
    volatile sdio_slc1int_raw_reg_t slc1int_raw;
    volatile sdio_slc1int_st_reg_t slc1int_st;
    volatile sdio_slc1int_ena_reg_t slc1int_ena;
    volatile sdio_slc1int_clr_reg_t slc1int_clr;
    volatile sdio_slcrx_status_reg_t slcrx_status;
    volatile sdio_slc0rxfifo_push_reg_t slc0rxfifo_push;
    volatile sdio_slc1rxfifo_push_reg_t slc1rxfifo_push;
    volatile sdio_slctx_status_reg_t slctx_status;
    volatile sdio_slc0txfifo_pop_reg_t slc0txfifo_pop;
    volatile sdio_slc1txfifo_pop_reg_t slc1txfifo_pop;
    volatile sdio_slc0rx_link_reg_t slc0rx_link;
    volatile sdio_slc0rx_link_addr_reg_t slc0rx_link_addr;
    volatile sdio_slc0tx_link_reg_t slc0tx_link;
    volatile sdio_slc0tx_link_addr_reg_t slc0tx_link_addr;
    volatile sdio_slc1rx_link_reg_t slc1rx_link;
    volatile sdio_slc1rx_link_addr_reg_t slc1rx_link_addr;
    volatile sdio_slc1tx_link_reg_t slc1tx_link;
    volatile sdio_slc1tx_link_addr_reg_t slc1tx_link_addr;
    volatile sdio_slcintvec_tohost_reg_t slcintvec_tohost;
    volatile sdio_slc0token0_reg_t slc0token0;
    volatile sdio_slc0token1_reg_t slc0token1;
    volatile sdio_slc1token0_reg_t slc1token0;
    volatile sdio_slc1token1_reg_t slc1token1;
    volatile sdio_slcconf1_reg_t slcconf1;
    volatile sdio_slc0_state0_reg_t slc0_state0;
    volatile sdio_slc0_state1_reg_t slc0_state1;
    volatile sdio_slc1_state0_reg_t slc1_state0;
    volatile sdio_slc1_state1_reg_t slc1_state1;
    volatile sdio_slcbridge_conf_reg_t slcbridge_conf;
    volatile sdio_slc0_to_eof_des_addr_reg_t slc0_to_eof_des_addr;
    volatile sdio_slc0_tx_eof_des_addr_reg_t slc0_tx_eof_des_addr;
    volatile sdio_slc0_to_eof_bfr_des_addr_reg_t slc0_to_eof_bfr_des_addr;
    volatile sdio_slc1_to_eof_des_addr_reg_t slc1_to_eof_des_addr;
    volatile sdio_slc1_tx_eof_des_addr_reg_t slc1_tx_eof_des_addr;
    volatile sdio_slc1_to_eof_bfr_des_addr_reg_t slc1_to_eof_bfr_des_addr;
    volatile sdio_slc_ahb_test_reg_t slc_ahb_test;
    volatile sdio_slc_sdio_st_reg_t slc_sdio_st;
    volatile sdio_slc_rx_dscr_conf_reg_t slc_rx_dscr_conf;
    volatile sdio_slc0_txlink_dscr_reg_t slc0_txlink_dscr;
    volatile sdio_slc0_txlink_dscr_bf0_reg_t slc0_txlink_dscr_bf0;
    volatile sdio_slc0_txlink_dscr_bf1_reg_t slc0_txlink_dscr_bf1;
    volatile sdio_slc0_rxlink_dscr_reg_t slc0_rxlink_dscr;
    volatile sdio_slc0_rxlink_dscr_bf0_reg_t slc0_rxlink_dscr_bf0;
    volatile sdio_slc0_rxlink_dscr_bf1_reg_t slc0_rxlink_dscr_bf1;
    volatile sdio_slc1_txlink_dscr_reg_t slc1_txlink_dscr;
    volatile sdio_slc1_txlink_dscr_bf0_reg_t slc1_txlink_dscr_bf0;
    volatile sdio_slc1_txlink_dscr_bf1_reg_t slc1_txlink_dscr_bf1;
    volatile sdio_slc1_rxlink_dscr_reg_t slc1_rxlink_dscr;
    volatile sdio_slc1_rxlink_dscr_bf0_reg_t slc1_rxlink_dscr_bf0;
    volatile sdio_slc1_rxlink_dscr_bf1_reg_t slc1_rxlink_dscr_bf1;
    volatile sdio_slc0_tx_erreof_des_addr_reg_t slc0_tx_erreof_des_addr;
    volatile sdio_slc1_tx_erreof_des_addr_reg_t slc1_tx_erreof_des_addr;
    volatile sdio_slc_token_lat_reg_t slc_token_lat;
    volatile sdio_slc_tx_dscr_conf_reg_t slc_tx_dscr_conf;
    volatile sdio_slc_cmd_infor0_reg_t slc_cmd_infor0;
    volatile sdio_slc_cmd_infor1_reg_t slc_cmd_infor1;
    volatile sdio_slc0_len_conf_reg_t slc0_len_conf;
    volatile sdio_slc0_length_reg_t slc0_length;
    volatile sdio_slc0_txpkt_h_dscr_reg_t slc0_txpkt_h_dscr;
    volatile sdio_slc0_txpkt_e_dscr_reg_t slc0_txpkt_e_dscr;
    volatile sdio_slc0_rxpkt_h_dscr_reg_t slc0_rxpkt_h_dscr;
    volatile sdio_slc0_rxpkt_e_dscr_reg_t slc0_rxpkt_e_dscr;
    volatile sdio_slc0_txpktu_h_dscr_reg_t slc0_txpktu_h_dscr;
    volatile sdio_slc0_txpktu_e_dscr_reg_t slc0_txpktu_e_dscr;
    volatile sdio_slc0_rxpktu_h_dscr_reg_t slc0_rxpktu_h_dscr;
    volatile sdio_slc0_rxpktu_e_dscr_reg_t slc0_rxpktu_e_dscr;
    volatile sdio_slc_seq_position_reg_t slc_seq_position;
    volatile sdio_slc0_dscr_rec_conf_reg_t slc0_dscr_rec_conf;
    volatile sdio_slc_sdio_crc_st0_reg_t slc_sdio_crc_st0;
    volatile sdio_slc_sdio_crc_st1_reg_t slc_sdio_crc_st1;
    volatile sdio_slc0_eof_start_des_reg_t slc0_eof_start_des;
    volatile sdio_slc0_push_dscr_addr_reg_t slc0_push_dscr_addr;
    volatile sdio_slc0_done_dscr_addr_reg_t slc0_done_dscr_addr;
    volatile sdio_slc0_sub_start_des_reg_t slc0_sub_start_des;
    volatile sdio_slc0_dscr_cnt_reg_t slc0_dscr_cnt;
    volatile sdio_slc0_len_lim_conf_reg_t slc0_len_lim_conf;
    volatile sdio_slc0int_st1_reg_t slc0int_st1;
    volatile sdio_slc0int_ena1_reg_t slc0int_ena1;
    volatile sdio_slc1int_st1_reg_t slc1int_st1;
    volatile sdio_slc1int_ena1_reg_t slc1int_ena1;
    volatile sdio_slc0_tx_sharemem_start_reg_t slc0_tx_sharemem_start;
    volatile sdio_slc0_tx_sharemem_end_reg_t slc0_tx_sharemem_end;
    volatile sdio_slc0_rx_sharemem_start_reg_t slc0_rx_sharemem_start;
    volatile sdio_slc0_rx_sharemem_end_reg_t slc0_rx_sharemem_end;
    volatile sdio_slc1_tx_sharemem_start_reg_t slc1_tx_sharemem_start;
    volatile sdio_slc1_tx_sharemem_end_reg_t slc1_tx_sharemem_end;
    volatile sdio_slc1_rx_sharemem_start_reg_t slc1_rx_sharemem_start;
    volatile sdio_slc1_rx_sharemem_end_reg_t slc1_rx_sharemem_end;
    volatile sdio_hda_tx_sharemem_start_reg_t hda_tx_sharemem_start;
    volatile sdio_hda_rx_sharemem_start_reg_t hda_rx_sharemem_start;
    volatile sdio_slc_burst_len_reg_t slc_burst_len;
    uint32_t reserved_180[30];
    volatile sdio_slcdate_reg_t slcdate;
    volatile sdio_slcid_reg_t slcid;
} slc_dev_t;

extern slc_dev_t SLC;

#ifndef __cplusplus
_Static_assert(sizeof(slc_dev_t) == 0x200, "Invalid size of slc_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
